app/Controllers/Socios.php

SELECT *
FROM `socios`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        if (!isset($this->sesion->id_usuario)) {
            return redirect()->to(base_url() . 'public/login');
        }

        //Esto serñia una consulta,  "Select * from socios"
        $socios = $this->socios->where('activo', $activo)->findAll();