app/Controllers/Usuarios.php

        public function actualizar($id){
            $this->usuarios->update($id,
            ['nombre'=>$this->request->getPost('nombre'),
            'apellido'=>$this->request->getPost('apellido'),
            'username'=>$this->request->getPost('username'),
            'clave'=>$this->request->getPost('clave'),
            'dni'=>$this->request->getPost('dni')

            ]
        );
---
UPDATE `usuarios` SET `nombre` = 'juan', `apellido` = 'perez', `username` = 'juanpe', `clave` = '$2y$10$/KHPrVUSH3RJBWyCWi4.b.miBBHvVt9U39H9kKkdbtUFTrFNUVUFC', `dni` = '252525251'
WHERE `usuarios`.`id` IN ('1')