app/Controllers/Usuarios.php

    public function index($activo = 1)
    {
        $usuarios = $this->usuarios->where('activo', $activo)->findAll();
---
SELECT *
FROM `usuarios`
WHERE `activo` = 1

    public function guardar(){
        $hash = password_hash($this->request->getPost('clave'), PASSWORD_DEFAULT);
        $this->usuarios->save(
            ['nombre'=>$this->request->getPost('nombre'),
            'apellido'=>$this->request->getPost('apellido'),
            'username'=>$this->request->getPost('username'),
            'clave'=>$hash,
            'dni'=>$this->request->getPost('dni')
            ]
        );
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `username`, `clave`, `dni`) VALUES ('', '', '', '$2y$10$M2/Q/NAL7UXaoi2hKJRYOu49pZ3Iz5IxIkpMNjKEp6yflVwRkM0Ju', '')

        public function borrar($id){
            $this->usuarios->update($id,['activo'=>0]);
---
UPDATE `usuarios` SET `activo` = 0
WHERE `usuarios`.`id` IN ('1')

        public function editar($id){
            $usuario = $this->usuarios->where('id', $id)->findAll();
---
SELECT *
FROM `usuarios`
WHERE `id` = '1'

        public function actualizar($id)
{

    $data = [
        'nombre' => $this->request->getPost('nombre'),
        'apellido' => $this->request->getPost('apellido'),
        'username' => $this->request->getPost('username'),
        'dni' => $this->request->getPost('dni')
    ];


    $clave_nueva = $this->request->getPost('clave');

    //Verificar si se ingresó una nueva contraseña
    if (!empty($clave_nueva)) {

        $hash = password_hash($clave_nueva, PASSWORD_DEFAULT);
        $data['clave'] = $hash;
    }


    $this->usuarios->update($id, $data);
---
UPDATE `usuarios` SET `nombre` = 'juan', `apellido` = 'perez', `username` = 'juanpe', `dni` = '252525251', `clave` = '$2y$10$.oVfsnMYc1D2iu.TkvR13e/u6SGZL6zHCB9cMhZJG17BPSirziuRe'
WHERE `usuarios`.`id` IN ('1')