app/Controllers/Zonas.php

    public function index($activo = 1)
    {
        //Esto seria una consulta,  "Select * from clientes"
        $zonas = $this->zonas->where('activo', $activo)->findAll();
---
SELECT *
FROM `zonas`
WHERE `activo` = 1

    public function guardar(){
        $this->zonas->save(
            ['denominacion'=>$this->request->getPost('denominacion')

            ]
        );
---
INSERT INTO `zonas` (`denominacion`) VALUES ('cuarto cuartel')

        public function editar($id){
            $zona = $this->zonas->where('id', $id)->findAll();
---
SELECT *
FROM `zonas`
WHERE `id` = '1'